name: "Authentication - Cross-Platform Brute Force Detection"
severity: "High"
cron: "*/5 * * * *"
telegram_alert: true
description: "Eyni mənbə IP-dən qısa zaman kəsiyində 10-dan çox uğursuz giriş cəhdi və ya 2-dən çox fərqli istifadəçi adına qarşı yönəlmiş şübhəli autentifikasiya cəhdləri aşkarlandı. Alert uğurlu giriş loqu ilə (Success) kəsişdikdə kritiklik səviyyəsi avtomatik olaraq 'Critical' olaraq qiymətləndirilir."
search: |
  index=* (EventCode IN (4624, 4625) OR sourcetype=access_too_small OR "failed password")
  | rex field=_raw "(?<c_ip>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})"
  | rex field=_raw "(?:user |for |login\/)(?<u_name>[a-zA-Z0-9._%+-]+)"
  | eval src_ip = lower(coalesce(IpAddress, c_ip, src_ip, "unknown")), 
         target_user = lower(coalesce(TargetUserName, u_name, user, "unknown")),
         is_success = if(EventCode==4624 OR match(lower(_raw), "accepted") OR status_code=="200" OR match(_raw, "HTTP\/1\..\" 200"), "Success", "Failed")
  | where src_ip!="unknown" AND src_ip!="127.0.0.1"
  | stats count(eval(is_success="Failed")) as failed, count(eval(is_success="Success")) as success, dc(target_user) as total_users, values(target_user) as tested_users, min(_time) as first_seen, max(_time) as last_seen by src_ip
  | where failed > 10 OR (total_users > 2 AND failed > 5)
  | eval alert_type = if(success > 0, "Critical - Brute Force SUCCESSFUL", "High - Brute Force Attempt")
  | sort - failed
